CSI API ETABS v1
cAnalysisResultsSetup.GetOptionDirectHist Method
 Retrieves the output option for direct history results.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOptionDirectHist(
	ref int Value
)
Function GetOptionDirectHist (
	ByRef Value As Integer
) As Integer
Dim instance As cAnalysisResultsSetup
Dim Value As Integer
Dim returnValue As Integer
returnValue = instance.GetOptionDirectHist(Value)
int GetOptionDirectHist(
	int% Value
)
abstract GetOptionDirectHist :
        Value : int byref -> int
Parameters
Value
Type: System.Int32
 This item is 1, 2 or 3
Envelopes
Step-by-Step
Last Step
Return Value
Type: Int32
 Returns zero if the output option is successfully retrieved, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Selected As Boolean
       Dim Value As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get output option
       ret = SapModel.Results.Setup.GetOptionDirectHist(Value)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace